compressible/dpEqn_Semi-Implicit_Inplace_GCIBM-sphere/case/0/gas/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    TOP
    {
        type            zeroGradient;
    }

    BOTTOM
    {
        type            zeroGradient;
    }

    FRONT
    {
        type            zeroGradient;
    }

    BACK
    {
        type            zeroGradient;
    }

    LEFT
    {
        type            zeroGradient;
    }

    RIGHT
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
